In [9]:
import pandas as pd
import sqlite3

connection = sqlite3.connect('pizza.sqlite') # or specify the path to the db file

pizzas = pd.read_sql('SELECT * FROM pizzas', connection)

In [10]:
toppings = pd.read_sql('SELECT * FROM toppings', connection)

In [11]:
modifiers = pd.read_sql('SELECT * FROM modifiers', connection)

In [12]:
sizes = pd.read_sql('SELECT * FROM sizes', connection)

## Questions

- What information is stored in the `toppings` table? How does this table relate
  to the `pizzas` table?

Toppings includes information for each topping: the id number, the name, and the price of the topping.
Pizzas includes information on each order: the pizza and order id (orders can have more than one pizza id), the crust type and the size of the pizza.
It aappears the two tables are not directly related but by another table(s) sharing foriegn keys

In [8]:
toppings.head()

   topping_id    topping_name  topping_price
0           1       pepperoni           0.99
1           2         sausage           0.99
2           3           bacon           0.99
3           4  canadian bacon           0.99
4           5           onion           0.49

In [23]:
pizzas

       pizza_id  order_id  crust_type_id  size_id
0          1001      1001              2        1
1          1002      1001              2        2
2          1003      1002              1        4
3          1004      1002              1        2
4          1005      1002              2        4
...         ...       ...            ...      ...
19929     20930     10998              2        4
19930     20931     10998              2        2
19931     20932     10999              2        3
19932     20933     11000              1        1
19933     20934     11000              2        4

[19934 rows x 4 columns]

- What information is stored in the `modifiers` table? How does this table relate
  to the `pizzas` table?

Modifiers contains the options for cheese topping amount, none or extra, and cooking the pizza well done. Only extra cheese has an additional charge.

In [7]:
modifiers

   modifier_id modifier_name  modifier_price
0            1  extra cheese            1.99
1            2     well done            0.00
2            3     no cheese            0.00

- How are the `pizzas` and `sizes` tables related?

Each pizza in the pizzas table has a size (size_id)

In [8]:
sizes

   size_id size_name  size_price
0        1     small        8.99
1        2    medium       10.99
2        3     large       12.99
3        4   x-large       14.99

- What other tables are in the database?

In [21]:
print(list(connection.execute('SELECT name from sqlite_master WHERE type = "table"')))

[('crust_types',), ('sizes',), ('toppings',), ('modifiers',), ('pizzas',), ('pizza_topppings',), ('pizza_modifiers',), ('pizza_toppings',)]

- How many unique toppings are there?

In [24]:
unique_toppings = pd.read_sql('SELECT DISTINCT * FROM toppings', connection)
print(unique_toppings)

   topping_id    topping_name  topping_price
0           1       pepperoni           0.99
1           2         sausage           0.99
2           3           bacon           0.99
3           4  canadian bacon           0.99
4           5           onion           0.49
5           6         peppers           0.49
6           7          olives           0.49
7           8       pineapple           0.79
8           9       hot sauce           0.19

- How many unique orders are in this dataset?

In [22]:
print("There are",len(pd.read_sql('SELECT DISTINCT order_id FROM pizzas', connection)),"orders.")

There are 10000 orders.

- Which size of pizza is sold the most?

In [56]:
(pd.read_sql('''
                    SELECT COUNT(size_id)
                    FROM pizzas
                    GROUP BY size_id'''
                     , connection
                    ))

   COUNT(size_id)
0            4893
1            5004
2            4901
3            5136

- How many pizzas have been sold in total?

In [42]:
pd.read_sql('SELECT count(pizza_id) FROM pizzas', connection)

   count(pizza_id)
0            19934

- What is the most common size of pizza ordered?

In [58]:
(pd.read_sql('''
                    SELECT MODE(size_id)
                    FROM pizzas'''
                     , connection
                    ))

DatabaseError: Execution failed on sql '
                    SELECT MODE(size_id)
                    FROM pizzas': no such function: MODE

- What is the average number of pizzas per order?

Find the total price for each order. The total price is the sum of:

- The price based on pizza size
- Any modifiers that need to be charged for
- The sum of the topping prices

Topping price is affected by the amount of the topping specified. A light amount
is half of the regular price. An extra amount is 1.5 times the regular price,
and double of the topping is double the price.

---

- What is the average price of pizzas that have no cheese?
- What is the most common size for pizzas that have extra cheese?
- What is the most common topping for pizzas that are well done?
- How many pizzas are only cheese (i.e. have no toppings)?
- How many orders consist of pizza(s) that are only cheese? What is the average
  price of these orders? The most common pizza size?
- How may large pizzas have olives on them?
- What is the average number of toppings per pizza?
- What is the average number of pizzas per order?
- What is the average pizza price?
- What is the average order total?
- What is the average number of items per order?
- What is the average number of toppings per pizza for each size of pizza?
- What is the average order total for orders that contain more than 1 pizza?
- What is the most common pizza size for orders that contain only a single
  pizza?
- How many orders consist of 3+ pizzas? What is the average number of toppings
  for these orders?
- What is the most common topping on large and extra large pizzas?
- What is the most common topping for orders that consist of 2 pizzas?
- Which size of pizza most frequently has modifiers?
- What percentage of pizzas with hot sauce have extra cheese?
- What is the average order price for orders that have at least 1 pizza with
  pineapple?